import Dashboard from "../models/dashboardModel.js";

import { createContactSchema } from "../schemas/dashboardSchema.js";

// Логіка пов'язана з контроллерами дошки:

// createBoard: Створює нову дошку для користувача та повертає її у відповіді.
// 1. Отримує ідентифікатор користувача з запиту.
// 2. Викликає сервіс для додавання нової дошки з даними з тіла запиту та ідентифікатором користувача.
// 3. Відповідає з статусом 201 та новоствореною дошкою.

export const createBoard = async (req, res) => {
  // ...
};

// getAllBoards: Отримує всі дошки, створені поточним користувачем, та повертає їх у відповіді.
// 1. Отримує ідентифікатор користувача з запиту.
// 2. Викликає сервіс для отримання списку всіх дошок користувача.
// 3. Відповідає з статусом 200 та списком дошок.

export const getAllBoards = async (req, res) => {
  // ...
};

// getById: Отримує дошку за ідентифікатором, а також всі колонки та задачі, пов'язані з цією дошкою, та повертає їх у відповіді.
// 1. Отримує ідентифікатор дошки з параметрів запиту.
// 2. Шукає дошку за ідентифікатором у базі даних.
// 3. Шукає всі колонки, пов'язані з дошкою.
// 4. Виконує агрегацію для отримання задач, пов'язаних з кожною колонкою.
// 5. Відповідає з знайденою дошкою та колонками з задачами, або порожнім масивом колонок, якщо їх немає.

export const getById = async (req, res) => {
  // ...
};

// deleteBoard: Видаляє дошку за ідентифікатором разом з усіма пов'язаними колонками та задачами, та повертає видалені об'єкти у відповіді.
// 1. Отримує ідентифікатор дошки з параметрів запиту.
// 2. Видаляє дошку за ідентифікатором з бази даних.
// 3. Шукає всі колонки, пов'язані з дошкою.
// 4. Видаляє всі колонки, пов'язані з дошкою.
// 5. Створює масив ідентифікаторів колонок.
// 6. Видаляє всі задачі, пов'язані з колонками.
// 7. Відповідає з видаленими дошкою, колонками та задачами, або викликає помилку 404, якщо об'єкти не знайдено.

export const deleteBoard = async (req, res) => {
  // ...
};

// updateCurrentBoard: Оновлює поточну дошку за ідентифікатором та повертає оновлену дошку у відповіді.
// 1. Отримує ідентифікатор дошки з параметрів запиту.
// 2. Викликає сервіс для оновлення дошки за ідентифікатором та даними з тіла запиту.
// 3. Відповідає з статусом 200 та оновленою дошкою.

export const updateCurrentBoard = async (req, res) => {
  // ...
};
